Tekla.Structures.Dialog.WindowBase
The WindowBase class is the base class for all Tekla Structures WPF dialogs.
The class provides localization, unit conversion and data storage
(temporary and file-based) among other things.

Tekla.Structures.Dialog.WindowBase.UseDefaultStyle
Use default style in all the window controls or not.
If the property is not set in the window constructor the default value (true) is used.

Tekla.Structures.Dialog.WindowBase.#ctor
The default constructor that does not need parameters.
Initializes the window and registers property bindings.

Tekla.Structures.Dialog.WindowBase.Localization
The localization instance for the dialog. Each dialog has its own localization instance
that has read the localization files needed for that dialog.

Tekla.Structures.Dialog.WindowBase.LocExtension
The localization instance for the dialog. Each dialog has its own localization instance
that has read the localization files needed for that dialog.

Tekla.Structures.Dialog.WindowBase.DialogAttributeTypes
Gets the names and types of all the fields that have proper custom attributes.

Tekla.Structures.Dialog.WindowBase.InitializeWindow
Prepares the data storage for the dialog and scans through the fields.

Tekla.Structures.Dialog.WindowBase.InitializeDataStorage
Prepares the data storage and creates listener to property changed event.

Tekla.Structures.Dialog.WindowBase.GetAttributeManager
Returns the attribute manager instance.

Tekla.Structures.Dialog.WindowBase.InitializeDistanceUnitDecimals
Gets the number of decimals Tekla Structures uses for displaying the "length" unit and
initializes the distance datatype to use that.
Returns: True if successful. False if failed.

Tekla.Structures.Dialog.WindowBase.InitializeAngleUnitDecimals
Gets the number of decimals Tekla Structures uses for displaying the angle unit and
initializes Tekla.Structures.Datatype.Angle class to use that.
Returns: True if successful. False if failed.

Tekla.Structures.Dialog.WindowBase.InitializeUnitDecimals
Gets the number of decimals Tekla Structures uses for displaying its units and
initializes the Tekla.Structures.Datatype classes to use them.
Returns: True if successful. False if failed.

Tekla.Structures.Dialog.WindowBase.GetUnitDecimals(Tekla.Structures.Dialog.dotdiaUnitTypes_e)
Gets the number of decimals Tekla Structures uses with the specified unit type.
unit: The specified unit type.
Returns: The number of decimals used, 0 (no decimals or invalid unit type) or -1 (failed).

Tekla.Structures.Dialog.WindowBase.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established.
Currently, there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Dialog.WindowBase.ShowWindow
Displays the window.

Tekla.Structures.Dialog.WindowBase.Apply
The method to call when the Apply button is clicked. Stores the current dialog
values to the dialog data storage.

Tekla.Structures.Dialog.WindowBase.Modify
The method to call when the Modify button is clicked.

Tekla.Structures.Dialog.WindowBase.Create
The method to call when the Create button is clicked.

Tekla.Structures.Dialog.WindowBase.RegisterAttribute(System.String,System.Type)
Registers an attribute without binding to a control.
AttributeName: The name of the attribute to be created.
ReturnType: The attribute type that will be returned.

Tekla.Structures.Dialog.WindowBase.RegisterAttribute(System.String,System.Type,System.Boolean)
Registers an attribute without binding to a control and a filter.
AttributeName: The name of the attribute to be created.
ReturnType: The attribute type that will be returned.
CreateFilter: The create filter for the attribute.

Tekla.Structures.Dialog.WindowBase.RegisterAttributes(System.Object)
Registers attributes defined in view model based on StructuresDialogAttribute definitions.
ViewModel: The class definition of the view model containing dialog attributes.

Tekla.Structures.Dialog.WindowBase.ReadFromDataStorage(Tekla.Structures.DialogInternal.DialogDataStorageBase)
Gets the values from the given data storage and sets the values for the
visible fields accordingly.
dataStorage: The data storage to read from.

Tekla.Structures.Dialog.WindowBase.WriteToDataStorage(Tekla.Structures.DialogInternal.DialogDataStorageBase,System.String)
Writes the values from the shown dialog to the given data storage.
dataStorage: The data storage to write to.
dialogname: The name of the dialog for the variable information.

Tekla.Structures.Dialog.WindowBase.ToggleSelection
Checks or unchecks all the enable check boxes.

Tekla.Structures.Dialog.WindowBase.LoadValuesPath(System.String)
Retrieves the full path for the file name. Called from LoadValues.
Override this function in order to change the default load path OR to add additional
actions on LoadValues.
FileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.WindowBase.ApplyValues(System.String)
Loads the dialog values from a file and performs Tekla.Structures.Dialog.WindowBase.Apply on the loaded values.
To match the files to a certain dialog, the file suffix is set as the dialog type's name.
FileName: The name of the file.

Tekla.Structures.Dialog.WindowBase.LoadValues(System.String)
Loads the dialog values from a file. To match the files to a certain dialog,
the file suffix is set as the dialog type's name.
FileName: The name of the file.

Tekla.Structures.Dialog.WindowBase.ModifyValues(System.String)
Loads the dialog values from a file and performs Tekla.Structures.Dialog.WindowBase.Modify on the loaded values.
To match the files to a certain dialog, the file suffix is set as the dialog type's name.
FileName: The name of the file.

Tekla.Structures.Dialog.WindowBase.LoadValues(System.String,Tekla.Structures.Dialog.WindowBase.ApplyModifyDelegate)
Loads the dialog values from a file. To match the files to a certain dialog,
the file suffix is set as the dialog type's name.
FileName: The name of the file.
applyModifyDelegate: The function to perform on the loaded values.

Tekla.Structures.Dialog.WindowBase.SaveValuesPath(System.String)
Retrieves the full path for the file name. Called from SaveValues.
Override this function in order to change the default save path OR to add additional
actions on SaveValues.
fileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.WindowBase.SaveValues(System.String)
Serializes the dialog values to an xml file.
fileName: The path of the file.

Tekla.Structures.Dialog.WindowBase.SetFilterValue(System.String,System.Boolean)
Sets a filter value for the given attribute. This method is needed for filter the attributes
which cannot be set from UI control.
AttributeName: The name of the attribute to be set.
Value: The new value set to the attribute.

Tekla.Structures.Dialog.WindowBase.SetAttributeValue(System.String,System.Object)
Sets a value for the given attribute. This method is needed for attributes which are not
bound to a control.
AttributeName: The name of the attribute to be set.
Value: The new value set to the attribute.

Tekla.Structures.Dialog.WindowBase.GetFilterValue(System.String)
Gets the filter value for the given attribute. This method is needed for attributes which are not
bound to a control or hidden in UI.
AttributeName: The name of the attribute.
Returns: The value gotten for the attribute filter.

Tekla.Structures.Dialog.WindowBase.GetAttributeValue``1(System.String)
Gets the value for the given attribute. This method is needed for attributes which are not
bound to a control.
The type of the returned variable.
AttributeName: The name of the attribute.
Returns: The value gotten from the attribute.

Tekla.Structures.Dialog.WindowBase.UpdateViewModelFromStorage(System.Object@)
DO NOT USE! For internal usage only!
viewModelClass:

Tekla.Structures.Dialog.WindowBase.UpdateDataStorageFromViewModel(System.Object)
DO NOT USE! For internal usage only!
viewModelClass:

Tekla.Structures.Dialog.WindowBase.GetAllViewModelDataProperties(System.Object)
DO NOT USE! For internal usage only!

Tekla.Structures.Dialog.WindowBase.GetDialogAttributeNameFromPropertyName(System.Object,System.String)
Gets dialog attribute name from view model base on given property name
viewModelClass: The view model class.
propertyName: The property name.
Returns: The name of the corresponding attribute.